espressif/esp-usb/host/usb/test/host_test/usb_host_layer_test/sdkconfig.defaults

CONFIG_IDF_TARGET="linux"
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=n
CONFIG_USB_HOST_ENABLE_ENUM_FILTER_CALLBACK=y
